7767517
550 573
pnnx.Input               pnnx_input_0             0 1 0 #0=(1,3,800,800)f32
pnnx.Expression          pnnx_expr_1829           0 1 1 expr=False
pnnx.Expression          pnnx_expr_1827           0 1 2 expr=6
torch.unbind             Tensor.select_599        1 1 0 3 dim=0 #0=(1,3,800,800)f32 #3=(3,800,800)f32
pnnx.Attribute           pnnx_fold_66             0 1 4 @data=(3,1,1)f32 #4=(3,1,1)f32
pnnx.Attribute           pnnx_fold_70             0 1 5 @data=(3,1,1)f32 #5=(3,1,1)f32
pnnx.Expression          pnnx_expr_1804           3 1 3 4 5 6 expr=div(sub(@0,@1),@2) #3=(3,800,800)f32 #4=(3,1,1)f32 #5=(3,1,1)f32 #6=(3,800,800)f32
torch.unsqueeze          torch.unsqueeze_545      1 1 6 7 dim=0 $input=6 #6=(3,800,800)f32 #7=(1,3,800,800)f32
torch.unbind             Tensor.select_608        1 1 7 8 dim=0 #7=(1,3,800,800)f32 #8=(3,800,800)f32
torch.stack              torch.stack_231          1 1 8 9 dim=0 #8=(3,800,800)f32 #9=(1,3,800,800)f32
nn.Conv2d                m.backbone.body.conv1    1 1 9 10 bias=False dilation=(1,1) groups=1 in_channels=3 kernel_size=(7,7) out_channels=64 padding=(3,3) padding_mode=zeros stride=(2,2) @weight=(64,3,7,7)f32 #9=(1,3,800,800)f32 #10=(1,64,400,400)f32
pnnx.Attribute           pnnx_fold_scale.8        0 1 11 @data=(1,64,1,1)f32 #11=(1,64,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.8        0 1 12 @data=(1,64,1,1)f32 #12=(1,64,1,1)f32
pnnx.Expression          pnnx_expr_1675           3 1 10 11 12 13 expr=add(mul(@0,@1),@2) #10=(1,64,400,400)f32 #11=(1,64,1,1)f32 #12=(1,64,1,1)f32 #13=(1,64,400,400)f32
nn.ReLU                  m.backbone.body.relu     1 1 13 14 #13=(1,64,400,400)f32 #14=(1,64,400,400)f32
nn.MaxPool2d             m.backbone.body.maxpool  1 1 14 15 ceil_mode=False dilation=(1,1) kernel_size=(3,3) padding=(1,1) return_indices=False stride=(2,2) #14=(1,64,400,400)f32 #15=(1,64,200,200)f32
nn.Conv2d                m.backbone.body.layer1.0.conv1 1 1 15 16 bias=False dilation=(1,1) groups=1 in_channels=64 kernel_size=(1,1) out_channels=64 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(64,64,1,1)f32 #15=(1,64,200,200)f32 #16=(1,64,200,200)f32
pnnx.Attribute           pnnx_fold_scale.10       0 1 17 @data=(1,64,1,1)f32 #17=(1,64,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.10       0 1 18 @data=(1,64,1,1)f32 #18=(1,64,1,1)f32
pnnx.Expression          pnnx_expr_1662           3 1 16 17 18 19 expr=add(mul(@0,@1),@2) #16=(1,64,200,200)f32 #17=(1,64,1,1)f32 #18=(1,64,1,1)f32 #19=(1,64,200,200)f32
nn.ReLU                  m.backbone.body.layer1.0.relu 1 1 19 20 #19=(1,64,200,200)f32 #20=(1,64,200,200)f32
nn.Conv2d                m.backbone.body.layer1.0.conv2 1 1 20 21 bias=False dilation=(1,1) groups=1 in_channels=64 kernel_size=(3,3) out_channels=64 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(64,64,3,3)f32 #20=(1,64,200,200)f32 #21=(1,64,200,200)f32
pnnx.Attribute           pnnx_fold_scale.12       0 1 22 @data=(1,64,1,1)f32 #22=(1,64,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.12       0 1 23 @data=(1,64,1,1)f32 #23=(1,64,1,1)f32
pnnx.Expression          pnnx_expr_1650           3 1 21 22 23 24 expr=add(mul(@0,@1),@2) #21=(1,64,200,200)f32 #22=(1,64,1,1)f32 #23=(1,64,1,1)f32 #24=(1,64,200,200)f32
nn.ReLU                  pnnx_unique_9            1 1 24 25 #24=(1,64,200,200)f32 #25=(1,64,200,200)f32
nn.Conv2d                m.backbone.body.layer1.0.conv3 1 1 25 26 bias=False dilation=(1,1) groups=1 in_channels=64 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,64,1,1)f32 #25=(1,64,200,200)f32 #26=(1,256,200,200)f32
pnnx.Attribute           pnnx_fold_scale.14       0 1 27 @data=(1,256,1,1)f32 #27=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.14       0 1 28 @data=(1,256,1,1)f32 #28=(1,256,1,1)f32
nn.Conv2d                m.backbone.body.layer1.0.downsample.0 1 1 15 29 bias=False dilation=(1,1) groups=1 in_channels=64 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,64,1,1)f32 #15=(1,64,200,200)f32 #29=(1,256,200,200)f32
pnnx.Attribute           pnnx_fold_scale.16       0 1 30 @data=(1,256,1,1)f32 #30=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.16       0 1 31 @data=(1,256,1,1)f32 #31=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1625           6 1 26 27 28 29 30 31 32 expr=add(add(mul(@0,@1),@2),add(mul(@3,@4),@5)) #26=(1,256,200,200)f32 #27=(1,256,1,1)f32 #28=(1,256,1,1)f32 #29=(1,256,200,200)f32 #30=(1,256,1,1)f32 #31=(1,256,1,1)f32 #32=(1,256,200,200)f32
nn.ReLU                  pnnx_unique_16           1 1 32 33 #32=(1,256,200,200)f32 #33=(1,256,200,200)f32
nn.Conv2d                m.backbone.body.layer1.1.conv1 1 1 33 34 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=64 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(64,256,1,1)f32 #33=(1,256,200,200)f32 #34=(1,64,200,200)f32
pnnx.Attribute           pnnx_fold_scale.18       0 1 35 @data=(1,64,1,1)f32 #35=(1,64,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.18       0 1 36 @data=(1,64,1,1)f32 #36=(1,64,1,1)f32
pnnx.Expression          pnnx_expr_1612           3 1 34 35 36 37 expr=add(mul(@0,@1),@2) #34=(1,64,200,200)f32 #35=(1,64,1,1)f32 #36=(1,64,1,1)f32 #37=(1,64,200,200)f32
nn.ReLU                  m.backbone.body.layer1.1.relu 1 1 37 38 #37=(1,64,200,200)f32 #38=(1,64,200,200)f32
nn.Conv2d                m.backbone.body.layer1.1.conv2 1 1 38 39 bias=False dilation=(1,1) groups=1 in_channels=64 kernel_size=(3,3) out_channels=64 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(64,64,3,3)f32 #38=(1,64,200,200)f32 #39=(1,64,200,200)f32
pnnx.Attribute           pnnx_fold_scale.20       0 1 40 @data=(1,64,1,1)f32 #40=(1,64,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.20       0 1 41 @data=(1,64,1,1)f32 #41=(1,64,1,1)f32
pnnx.Expression          pnnx_expr_1600           3 1 39 40 41 42 expr=add(mul(@0,@1),@2) #39=(1,64,200,200)f32 #40=(1,64,1,1)f32 #41=(1,64,1,1)f32 #42=(1,64,200,200)f32
nn.ReLU                  pnnx_unique_23           1 1 42 43 #42=(1,64,200,200)f32 #43=(1,64,200,200)f32
nn.Conv2d                m.backbone.body.layer1.1.conv3 1 1 43 44 bias=False dilation=(1,1) groups=1 in_channels=64 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,64,1,1)f32 #43=(1,64,200,200)f32 #44=(1,256,200,200)f32
pnnx.Attribute           pnnx_fold_scale.22       0 1 45 @data=(1,256,1,1)f32 #45=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.22       0 1 46 @data=(1,256,1,1)f32 #46=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1587           4 1 44 45 46 33 47 expr=add(add(mul(@0,@1),@2),@3) #44=(1,256,200,200)f32 #45=(1,256,1,1)f32 #46=(1,256,1,1)f32 #33=(1,256,200,200)f32 #47=(1,256,200,200)f32
nn.ReLU                  pnnx_unique_27           1 1 47 48 #47=(1,256,200,200)f32 #48=(1,256,200,200)f32
nn.Conv2d                m.backbone.body.layer1.2.conv1 1 1 48 49 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=64 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(64,256,1,1)f32 #48=(1,256,200,200)f32 #49=(1,64,200,200)f32
pnnx.Attribute           pnnx_fold_scale.24       0 1 50 @data=(1,64,1,1)f32 #50=(1,64,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.24       0 1 51 @data=(1,64,1,1)f32 #51=(1,64,1,1)f32
pnnx.Expression          pnnx_expr_1574           3 1 49 50 51 52 expr=add(mul(@0,@1),@2) #49=(1,64,200,200)f32 #50=(1,64,1,1)f32 #51=(1,64,1,1)f32 #52=(1,64,200,200)f32
nn.ReLU                  m.backbone.body.layer1.2.relu 1 1 52 53 #52=(1,64,200,200)f32 #53=(1,64,200,200)f32
nn.Conv2d                m.backbone.body.layer1.2.conv2 1 1 53 54 bias=False dilation=(1,1) groups=1 in_channels=64 kernel_size=(3,3) out_channels=64 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(64,64,3,3)f32 #53=(1,64,200,200)f32 #54=(1,64,200,200)f32
pnnx.Attribute           pnnx_fold_scale.26       0 1 55 @data=(1,64,1,1)f32 #55=(1,64,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.26       0 1 56 @data=(1,64,1,1)f32 #56=(1,64,1,1)f32
pnnx.Expression          pnnx_expr_1562           3 1 54 55 56 57 expr=add(mul(@0,@1),@2) #54=(1,64,200,200)f32 #55=(1,64,1,1)f32 #56=(1,64,1,1)f32 #57=(1,64,200,200)f32
nn.ReLU                  pnnx_unique_34           1 1 57 58 #57=(1,64,200,200)f32 #58=(1,64,200,200)f32
nn.Conv2d                m.backbone.body.layer1.2.conv3 1 1 58 59 bias=False dilation=(1,1) groups=1 in_channels=64 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,64,1,1)f32 #58=(1,64,200,200)f32 #59=(1,256,200,200)f32
pnnx.Attribute           pnnx_fold_scale.28       0 1 60 @data=(1,256,1,1)f32 #60=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.28       0 1 61 @data=(1,256,1,1)f32 #61=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1549           4 1 59 60 61 48 62 expr=add(add(mul(@0,@1),@2),@3) #59=(1,256,200,200)f32 #60=(1,256,1,1)f32 #61=(1,256,1,1)f32 #48=(1,256,200,200)f32 #62=(1,256,200,200)f32
nn.ReLU                  pnnx_unique_38           1 1 62 63 #62=(1,256,200,200)f32 #63=(1,256,200,200)f32
nn.Conv2d                m.backbone.body.layer2.0.conv1 1 1 63 64 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=128 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(128,256,1,1)f32 #63=(1,256,200,200)f32 #64=(1,128,200,200)f32
pnnx.Attribute           pnnx_fold_scale.30       0 1 65 @data=(1,128,1,1)f32 #65=(1,128,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.30       0 1 66 @data=(1,128,1,1)f32 #66=(1,128,1,1)f32
pnnx.Expression          pnnx_expr_1536           3 1 64 65 66 67 expr=add(mul(@0,@1),@2) #64=(1,128,200,200)f32 #65=(1,128,1,1)f32 #66=(1,128,1,1)f32 #67=(1,128,200,200)f32
nn.ReLU                  m.backbone.body.layer2.0.relu 1 1 67 68 #67=(1,128,200,200)f32 #68=(1,128,200,200)f32
nn.Conv2d                m.backbone.body.layer2.0.conv2 1 1 68 69 bias=False dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(2,2) @weight=(128,128,3,3)f32 #68=(1,128,200,200)f32 #69=(1,128,100,100)f32
pnnx.Attribute           pnnx_fold_scale.32       0 1 70 @data=(1,128,1,1)f32 #70=(1,128,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.32       0 1 71 @data=(1,128,1,1)f32 #71=(1,128,1,1)f32
pnnx.Expression          pnnx_expr_1524           3 1 69 70 71 72 expr=add(mul(@0,@1),@2) #69=(1,128,100,100)f32 #70=(1,128,1,1)f32 #71=(1,128,1,1)f32 #72=(1,128,100,100)f32
nn.ReLU                  pnnx_unique_45           1 1 72 73 #72=(1,128,100,100)f32 #73=(1,128,100,100)f32
nn.Conv2d                m.backbone.body.layer2.0.conv3 1 1 73 74 bias=False dilation=(1,1) groups=1 in_channels=128 kernel_size=(1,1) out_channels=512 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(512,128,1,1)f32 #73=(1,128,100,100)f32 #74=(1,512,100,100)f32
pnnx.Attribute           pnnx_fold_scale.34       0 1 75 @data=(1,512,1,1)f32 #75=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.34       0 1 76 @data=(1,512,1,1)f32 #76=(1,512,1,1)f32
nn.Conv2d                m.backbone.body.layer2.0.downsample.0 1 1 63 77 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=512 padding=(0,0) padding_mode=zeros stride=(2,2) @weight=(512,256,1,1)f32 #63=(1,256,200,200)f32 #77=(1,512,100,100)f32
pnnx.Attribute           pnnx_fold_scale.36       0 1 78 @data=(1,512,1,1)f32 #78=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.36       0 1 79 @data=(1,512,1,1)f32 #79=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1499           6 1 74 75 76 77 78 79 80 expr=add(add(mul(@0,@1),@2),add(mul(@3,@4),@5)) #74=(1,512,100,100)f32 #75=(1,512,1,1)f32 #76=(1,512,1,1)f32 #77=(1,512,100,100)f32 #78=(1,512,1,1)f32 #79=(1,512,1,1)f32 #80=(1,512,100,100)f32
nn.ReLU                  pnnx_unique_52           1 1 80 81 #80=(1,512,100,100)f32 #81=(1,512,100,100)f32
nn.Conv2d                m.backbone.body.layer2.1.conv1 1 1 81 82 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(1,1) out_channels=128 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(128,512,1,1)f32 #81=(1,512,100,100)f32 #82=(1,128,100,100)f32
pnnx.Attribute           pnnx_fold_scale.38       0 1 83 @data=(1,128,1,1)f32 #83=(1,128,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.38       0 1 84 @data=(1,128,1,1)f32 #84=(1,128,1,1)f32
pnnx.Expression          pnnx_expr_1486           3 1 82 83 84 85 expr=add(mul(@0,@1),@2) #82=(1,128,100,100)f32 #83=(1,128,1,1)f32 #84=(1,128,1,1)f32 #85=(1,128,100,100)f32
nn.ReLU                  m.backbone.body.layer2.1.relu 1 1 85 86 #85=(1,128,100,100)f32 #86=(1,128,100,100)f32
nn.Conv2d                m.backbone.body.layer2.1.conv2 1 1 86 87 bias=False dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(128,128,3,3)f32 #86=(1,128,100,100)f32 #87=(1,128,100,100)f32
pnnx.Attribute           pnnx_fold_scale.40       0 1 88 @data=(1,128,1,1)f32 #88=(1,128,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.40       0 1 89 @data=(1,128,1,1)f32 #89=(1,128,1,1)f32
pnnx.Expression          pnnx_expr_1474           3 1 87 88 89 90 expr=add(mul(@0,@1),@2) #87=(1,128,100,100)f32 #88=(1,128,1,1)f32 #89=(1,128,1,1)f32 #90=(1,128,100,100)f32
nn.ReLU                  pnnx_unique_59           1 1 90 91 #90=(1,128,100,100)f32 #91=(1,128,100,100)f32
nn.Conv2d                m.backbone.body.layer2.1.conv3 1 1 91 92 bias=False dilation=(1,1) groups=1 in_channels=128 kernel_size=(1,1) out_channels=512 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(512,128,1,1)f32 #91=(1,128,100,100)f32 #92=(1,512,100,100)f32
pnnx.Attribute           pnnx_fold_scale.42       0 1 93 @data=(1,512,1,1)f32 #93=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.42       0 1 94 @data=(1,512,1,1)f32 #94=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1461           4 1 92 93 94 81 95 expr=add(add(mul(@0,@1),@2),@3) #92=(1,512,100,100)f32 #93=(1,512,1,1)f32 #94=(1,512,1,1)f32 #81=(1,512,100,100)f32 #95=(1,512,100,100)f32
nn.ReLU                  pnnx_unique_63           1 1 95 96 #95=(1,512,100,100)f32 #96=(1,512,100,100)f32
nn.Conv2d                m.backbone.body.layer2.2.conv1 1 1 96 97 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(1,1) out_channels=128 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(128,512,1,1)f32 #96=(1,512,100,100)f32 #97=(1,128,100,100)f32
pnnx.Attribute           pnnx_fold_scale.44       0 1 98 @data=(1,128,1,1)f32 #98=(1,128,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.44       0 1 99 @data=(1,128,1,1)f32 #99=(1,128,1,1)f32
pnnx.Expression          pnnx_expr_1448           3 1 97 98 99 100 expr=add(mul(@0,@1),@2) #97=(1,128,100,100)f32 #98=(1,128,1,1)f32 #99=(1,128,1,1)f32 #100=(1,128,100,100)f32
nn.ReLU                  m.backbone.body.layer2.2.relu 1 1 100 101 #100=(1,128,100,100)f32 #101=(1,128,100,100)f32
nn.Conv2d                m.backbone.body.layer2.2.conv2 1 1 101 102 bias=False dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(128,128,3,3)f32 #101=(1,128,100,100)f32 #102=(1,128,100,100)f32
pnnx.Attribute           pnnx_fold_scale.46       0 1 103 @data=(1,128,1,1)f32 #103=(1,128,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.46       0 1 104 @data=(1,128,1,1)f32 #104=(1,128,1,1)f32
pnnx.Expression          pnnx_expr_1436           3 1 102 103 104 105 expr=add(mul(@0,@1),@2) #102=(1,128,100,100)f32 #103=(1,128,1,1)f32 #104=(1,128,1,1)f32 #105=(1,128,100,100)f32
nn.ReLU                  pnnx_unique_70           1 1 105 106 #105=(1,128,100,100)f32 #106=(1,128,100,100)f32
nn.Conv2d                m.backbone.body.layer2.2.conv3 1 1 106 107 bias=False dilation=(1,1) groups=1 in_channels=128 kernel_size=(1,1) out_channels=512 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(512,128,1,1)f32 #106=(1,128,100,100)f32 #107=(1,512,100,100)f32
pnnx.Attribute           pnnx_fold_scale.48       0 1 108 @data=(1,512,1,1)f32 #108=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.48       0 1 109 @data=(1,512,1,1)f32 #109=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1423           4 1 107 108 109 96 110 expr=add(add(mul(@0,@1),@2),@3) #107=(1,512,100,100)f32 #108=(1,512,1,1)f32 #109=(1,512,1,1)f32 #96=(1,512,100,100)f32 #110=(1,512,100,100)f32
nn.ReLU                  pnnx_unique_74           1 1 110 111 #110=(1,512,100,100)f32 #111=(1,512,100,100)f32
nn.Conv2d                m.backbone.body.layer2.3.conv1 1 1 111 112 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(1,1) out_channels=128 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(128,512,1,1)f32 #111=(1,512,100,100)f32 #112=(1,128,100,100)f32
pnnx.Attribute           pnnx_fold_scale.50       0 1 113 @data=(1,128,1,1)f32 #113=(1,128,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.50       0 1 114 @data=(1,128,1,1)f32 #114=(1,128,1,1)f32
pnnx.Expression          pnnx_expr_1410           3 1 112 113 114 115 expr=add(mul(@0,@1),@2) #112=(1,128,100,100)f32 #113=(1,128,1,1)f32 #114=(1,128,1,1)f32 #115=(1,128,100,100)f32
nn.ReLU                  m.backbone.body.layer2.3.relu 1 1 115 116 #115=(1,128,100,100)f32 #116=(1,128,100,100)f32
nn.Conv2d                m.backbone.body.layer2.3.conv2 1 1 116 117 bias=False dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(128,128,3,3)f32 #116=(1,128,100,100)f32 #117=(1,128,100,100)f32
pnnx.Attribute           pnnx_fold_scale.52       0 1 118 @data=(1,128,1,1)f32 #118=(1,128,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.52       0 1 119 @data=(1,128,1,1)f32 #119=(1,128,1,1)f32
pnnx.Expression          pnnx_expr_1398           3 1 117 118 119 120 expr=add(mul(@0,@1),@2) #117=(1,128,100,100)f32 #118=(1,128,1,1)f32 #119=(1,128,1,1)f32 #120=(1,128,100,100)f32
nn.ReLU                  pnnx_unique_81           1 1 120 121 #120=(1,128,100,100)f32 #121=(1,128,100,100)f32
nn.Conv2d                m.backbone.body.layer2.3.conv3 1 1 121 122 bias=False dilation=(1,1) groups=1 in_channels=128 kernel_size=(1,1) out_channels=512 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(512,128,1,1)f32 #121=(1,128,100,100)f32 #122=(1,512,100,100)f32
pnnx.Attribute           pnnx_fold_scale.54       0 1 123 @data=(1,512,1,1)f32 #123=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.54       0 1 124 @data=(1,512,1,1)f32 #124=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1385           4 1 122 123 124 111 125 expr=add(add(mul(@0,@1),@2),@3) #122=(1,512,100,100)f32 #123=(1,512,1,1)f32 #124=(1,512,1,1)f32 #111=(1,512,100,100)f32 #125=(1,512,100,100)f32
nn.ReLU                  pnnx_unique_85           1 1 125 126 #125=(1,512,100,100)f32 #126=(1,512,100,100)f32
nn.Conv2d                m.backbone.body.layer3.0.conv1 1 1 126 127 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,512,1,1)f32 #126=(1,512,100,100)f32 #127=(1,256,100,100)f32
pnnx.Attribute           pnnx_fold_scale.56       0 1 128 @data=(1,256,1,1)f32 #128=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.56       0 1 129 @data=(1,256,1,1)f32 #129=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1372           3 1 127 128 129 130 expr=add(mul(@0,@1),@2) #127=(1,256,100,100)f32 #128=(1,256,1,1)f32 #129=(1,256,1,1)f32 #130=(1,256,100,100)f32
nn.ReLU                  m.backbone.body.layer3.0.relu 1 1 130 131 #130=(1,256,100,100)f32 #131=(1,256,100,100)f32
nn.Conv2d                m.backbone.body.layer3.0.conv2 1 1 131 132 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(2,2) @weight=(256,256,3,3)f32 #131=(1,256,100,100)f32 #132=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.58       0 1 133 @data=(1,256,1,1)f32 #133=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.58       0 1 134 @data=(1,256,1,1)f32 #134=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1360           3 1 132 133 134 135 expr=add(mul(@0,@1),@2) #132=(1,256,50,50)f32 #133=(1,256,1,1)f32 #134=(1,256,1,1)f32 #135=(1,256,50,50)f32
nn.ReLU                  pnnx_unique_92           1 1 135 136 #135=(1,256,50,50)f32 #136=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.0.conv3 1 1 136 137 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=1024 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(1024,256,1,1)f32 #136=(1,256,50,50)f32 #137=(1,1024,50,50)f32
pnnx.Attribute           pnnx_fold_scale.60       0 1 138 @data=(1,1024,1,1)f32 #138=(1,1024,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.60       0 1 139 @data=(1,1024,1,1)f32 #139=(1,1024,1,1)f32
nn.Conv2d                m.backbone.body.layer3.0.downsample.0 1 1 126 140 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(1,1) out_channels=1024 padding=(0,0) padding_mode=zeros stride=(2,2) @weight=(1024,512,1,1)f32 #126=(1,512,100,100)f32 #140=(1,1024,50,50)f32
pnnx.Attribute           pnnx_fold_scale.62       0 1 141 @data=(1,1024,1,1)f32 #141=(1,1024,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.62       0 1 142 @data=(1,1024,1,1)f32 #142=(1,1024,1,1)f32
pnnx.Expression          pnnx_expr_1335           6 1 137 138 139 140 141 142 143 expr=add(add(mul(@0,@1),@2),add(mul(@3,@4),@5)) #137=(1,1024,50,50)f32 #138=(1,1024,1,1)f32 #139=(1,1024,1,1)f32 #140=(1,1024,50,50)f32 #141=(1,1024,1,1)f32 #142=(1,1024,1,1)f32 #143=(1,1024,50,50)f32
nn.ReLU                  pnnx_unique_99           1 1 143 144 #143=(1,1024,50,50)f32 #144=(1,1024,50,50)f32
nn.Conv2d                m.backbone.body.layer3.1.conv1 1 1 144 145 bias=False dilation=(1,1) groups=1 in_channels=1024 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,1024,1,1)f32 #144=(1,1024,50,50)f32 #145=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.64       0 1 146 @data=(1,256,1,1)f32 #146=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.64       0 1 147 @data=(1,256,1,1)f32 #147=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1322           3 1 145 146 147 148 expr=add(mul(@0,@1),@2) #145=(1,256,50,50)f32 #146=(1,256,1,1)f32 #147=(1,256,1,1)f32 #148=(1,256,50,50)f32
nn.ReLU                  m.backbone.body.layer3.1.relu 1 1 148 149 #148=(1,256,50,50)f32 #149=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.1.conv2 1 1 149 150 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(256,256,3,3)f32 #149=(1,256,50,50)f32 #150=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.66       0 1 151 @data=(1,256,1,1)f32 #151=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.66       0 1 152 @data=(1,256,1,1)f32 #152=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1310           3 1 150 151 152 153 expr=add(mul(@0,@1),@2) #150=(1,256,50,50)f32 #151=(1,256,1,1)f32 #152=(1,256,1,1)f32 #153=(1,256,50,50)f32
nn.ReLU                  pnnx_unique_106          1 1 153 154 #153=(1,256,50,50)f32 #154=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.1.conv3 1 1 154 155 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=1024 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(1024,256,1,1)f32 #154=(1,256,50,50)f32 #155=(1,1024,50,50)f32
pnnx.Attribute           pnnx_fold_scale.68       0 1 156 @data=(1,1024,1,1)f32 #156=(1,1024,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.68       0 1 157 @data=(1,1024,1,1)f32 #157=(1,1024,1,1)f32
pnnx.Expression          pnnx_expr_1297           4 1 155 156 157 144 158 expr=add(add(mul(@0,@1),@2),@3) #155=(1,1024,50,50)f32 #156=(1,1024,1,1)f32 #157=(1,1024,1,1)f32 #144=(1,1024,50,50)f32 #158=(1,1024,50,50)f32
nn.ReLU                  pnnx_unique_110          1 1 158 159 #158=(1,1024,50,50)f32 #159=(1,1024,50,50)f32
nn.Conv2d                m.backbone.body.layer3.2.conv1 1 1 159 160 bias=False dilation=(1,1) groups=1 in_channels=1024 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,1024,1,1)f32 #159=(1,1024,50,50)f32 #160=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.15       0 1 161 @data=(1,256,1,1)f32 #161=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.15       0 1 162 @data=(1,256,1,1)f32 #162=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1284           3 1 160 161 162 163 expr=add(mul(@0,@1),@2) #160=(1,256,50,50)f32 #161=(1,256,1,1)f32 #162=(1,256,1,1)f32 #163=(1,256,50,50)f32
nn.ReLU                  m.backbone.body.layer3.2.relu 1 1 163 164 #163=(1,256,50,50)f32 #164=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.2.conv2 1 1 164 165 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(256,256,3,3)f32 #164=(1,256,50,50)f32 #165=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.17       0 1 166 @data=(1,256,1,1)f32 #166=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.17       0 1 167 @data=(1,256,1,1)f32 #167=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1272           3 1 165 166 167 168 expr=add(mul(@0,@1),@2) #165=(1,256,50,50)f32 #166=(1,256,1,1)f32 #167=(1,256,1,1)f32 #168=(1,256,50,50)f32
nn.ReLU                  pnnx_unique_117          1 1 168 169 #168=(1,256,50,50)f32 #169=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.2.conv3 1 1 169 170 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=1024 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(1024,256,1,1)f32 #169=(1,256,50,50)f32 #170=(1,1024,50,50)f32
pnnx.Attribute           pnnx_fold_scale.19       0 1 171 @data=(1,1024,1,1)f32 #171=(1,1024,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.19       0 1 172 @data=(1,1024,1,1)f32 #172=(1,1024,1,1)f32
pnnx.Expression          pnnx_expr_1259           4 1 170 171 172 159 173 expr=add(add(mul(@0,@1),@2),@3) #170=(1,1024,50,50)f32 #171=(1,1024,1,1)f32 #172=(1,1024,1,1)f32 #159=(1,1024,50,50)f32 #173=(1,1024,50,50)f32
nn.ReLU                  pnnx_unique_121          1 1 173 174 #173=(1,1024,50,50)f32 #174=(1,1024,50,50)f32
nn.Conv2d                m.backbone.body.layer3.3.conv1 1 1 174 175 bias=False dilation=(1,1) groups=1 in_channels=1024 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,1024,1,1)f32 #174=(1,1024,50,50)f32 #175=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.21       0 1 176 @data=(1,256,1,1)f32 #176=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.21       0 1 177 @data=(1,256,1,1)f32 #177=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1246           3 1 175 176 177 178 expr=add(mul(@0,@1),@2) #175=(1,256,50,50)f32 #176=(1,256,1,1)f32 #177=(1,256,1,1)f32 #178=(1,256,50,50)f32
nn.ReLU                  m.backbone.body.layer3.3.relu 1 1 178 179 #178=(1,256,50,50)f32 #179=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.3.conv2 1 1 179 180 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(256,256,3,3)f32 #179=(1,256,50,50)f32 #180=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.23       0 1 181 @data=(1,256,1,1)f32 #181=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.23       0 1 182 @data=(1,256,1,1)f32 #182=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1234           3 1 180 181 182 183 expr=add(mul(@0,@1),@2) #180=(1,256,50,50)f32 #181=(1,256,1,1)f32 #182=(1,256,1,1)f32 #183=(1,256,50,50)f32
nn.ReLU                  pnnx_unique_128          1 1 183 184 #183=(1,256,50,50)f32 #184=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.3.conv3 1 1 184 185 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=1024 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(1024,256,1,1)f32 #184=(1,256,50,50)f32 #185=(1,1024,50,50)f32
pnnx.Attribute           pnnx_fold_scale.25       0 1 186 @data=(1,1024,1,1)f32 #186=(1,1024,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.25       0 1 187 @data=(1,1024,1,1)f32 #187=(1,1024,1,1)f32
pnnx.Expression          pnnx_expr_1221           4 1 185 186 187 174 188 expr=add(add(mul(@0,@1),@2),@3) #185=(1,1024,50,50)f32 #186=(1,1024,1,1)f32 #187=(1,1024,1,1)f32 #174=(1,1024,50,50)f32 #188=(1,1024,50,50)f32
nn.ReLU                  pnnx_unique_132          1 1 188 189 #188=(1,1024,50,50)f32 #189=(1,1024,50,50)f32
nn.Conv2d                m.backbone.body.layer3.4.conv1 1 1 189 190 bias=False dilation=(1,1) groups=1 in_channels=1024 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,1024,1,1)f32 #189=(1,1024,50,50)f32 #190=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.27       0 1 191 @data=(1,256,1,1)f32 #191=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.27       0 1 192 @data=(1,256,1,1)f32 #192=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1208           3 1 190 191 192 193 expr=add(mul(@0,@1),@2) #190=(1,256,50,50)f32 #191=(1,256,1,1)f32 #192=(1,256,1,1)f32 #193=(1,256,50,50)f32
nn.ReLU                  m.backbone.body.layer3.4.relu 1 1 193 194 #193=(1,256,50,50)f32 #194=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.4.conv2 1 1 194 195 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(256,256,3,3)f32 #194=(1,256,50,50)f32 #195=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.29       0 1 196 @data=(1,256,1,1)f32 #196=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.29       0 1 197 @data=(1,256,1,1)f32 #197=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1196           3 1 195 196 197 198 expr=add(mul(@0,@1),@2) #195=(1,256,50,50)f32 #196=(1,256,1,1)f32 #197=(1,256,1,1)f32 #198=(1,256,50,50)f32
nn.ReLU                  pnnx_unique_139          1 1 198 199 #198=(1,256,50,50)f32 #199=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.4.conv3 1 1 199 200 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=1024 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(1024,256,1,1)f32 #199=(1,256,50,50)f32 #200=(1,1024,50,50)f32
pnnx.Attribute           pnnx_fold_scale.31       0 1 201 @data=(1,1024,1,1)f32 #201=(1,1024,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.31       0 1 202 @data=(1,1024,1,1)f32 #202=(1,1024,1,1)f32
pnnx.Expression          pnnx_expr_1183           4 1 200 201 202 189 203 expr=add(add(mul(@0,@1),@2),@3) #200=(1,1024,50,50)f32 #201=(1,1024,1,1)f32 #202=(1,1024,1,1)f32 #189=(1,1024,50,50)f32 #203=(1,1024,50,50)f32
nn.ReLU                  pnnx_unique_143          1 1 203 204 #203=(1,1024,50,50)f32 #204=(1,1024,50,50)f32
nn.Conv2d                m.backbone.body.layer3.5.conv1 1 1 204 205 bias=False dilation=(1,1) groups=1 in_channels=1024 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(256,1024,1,1)f32 #204=(1,1024,50,50)f32 #205=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.70       0 1 206 @data=(1,256,1,1)f32 #206=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.70       0 1 207 @data=(1,256,1,1)f32 #207=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1170           3 1 205 206 207 208 expr=add(mul(@0,@1),@2) #205=(1,256,50,50)f32 #206=(1,256,1,1)f32 #207=(1,256,1,1)f32 #208=(1,256,50,50)f32
nn.ReLU                  m.backbone.body.layer3.5.relu 1 1 208 209 #208=(1,256,50,50)f32 #209=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.5.conv2 1 1 209 210 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(256,256,3,3)f32 #209=(1,256,50,50)f32 #210=(1,256,50,50)f32
pnnx.Attribute           pnnx_fold_scale.72       0 1 211 @data=(1,256,1,1)f32 #211=(1,256,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.72       0 1 212 @data=(1,256,1,1)f32 #212=(1,256,1,1)f32
pnnx.Expression          pnnx_expr_1158           3 1 210 211 212 213 expr=add(mul(@0,@1),@2) #210=(1,256,50,50)f32 #211=(1,256,1,1)f32 #212=(1,256,1,1)f32 #213=(1,256,50,50)f32
nn.ReLU                  pnnx_unique_150          1 1 213 214 #213=(1,256,50,50)f32 #214=(1,256,50,50)f32
nn.Conv2d                m.backbone.body.layer3.5.conv3 1 1 214 215 bias=False dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=1024 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(1024,256,1,1)f32 #214=(1,256,50,50)f32 #215=(1,1024,50,50)f32
pnnx.Attribute           pnnx_fold_scale.74       0 1 216 @data=(1,1024,1,1)f32 #216=(1,1024,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.74       0 1 217 @data=(1,1024,1,1)f32 #217=(1,1024,1,1)f32
pnnx.Expression          pnnx_expr_1145           4 1 215 216 217 204 218 expr=add(add(mul(@0,@1),@2),@3) #215=(1,1024,50,50)f32 #216=(1,1024,1,1)f32 #217=(1,1024,1,1)f32 #204=(1,1024,50,50)f32 #218=(1,1024,50,50)f32
nn.ReLU                  pnnx_unique_154          1 1 218 219 #218=(1,1024,50,50)f32 #219=(1,1024,50,50)f32
nn.Conv2d                m.backbone.body.layer4.0.conv1 1 1 219 220 bias=False dilation=(1,1) groups=1 in_channels=1024 kernel_size=(1,1) out_channels=512 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(512,1024,1,1)f32 #219=(1,1024,50,50)f32 #220=(1,512,50,50)f32
pnnx.Attribute           pnnx_fold_scale.3        0 1 221 @data=(1,512,1,1)f32 #221=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.3        0 1 222 @data=(1,512,1,1)f32 #222=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1132           3 1 220 221 222 223 expr=add(mul(@0,@1),@2) #220=(1,512,50,50)f32 #221=(1,512,1,1)f32 #222=(1,512,1,1)f32 #223=(1,512,50,50)f32
nn.ReLU                  m.backbone.body.layer4.0.relu 1 1 223 224 #223=(1,512,50,50)f32 #224=(1,512,50,50)f32
nn.Conv2d                m.backbone.body.layer4.0.conv2 1 1 224 225 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(3,3) out_channels=512 padding=(1,1) padding_mode=zeros stride=(2,2) @weight=(512,512,3,3)f32 #224=(1,512,50,50)f32 #225=(1,512,25,25)f32
pnnx.Attribute           pnnx_fold_scale.5        0 1 226 @data=(1,512,1,1)f32 #226=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.5        0 1 227 @data=(1,512,1,1)f32 #227=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1120           3 1 225 226 227 228 expr=add(mul(@0,@1),@2) #225=(1,512,25,25)f32 #226=(1,512,1,1)f32 #227=(1,512,1,1)f32 #228=(1,512,25,25)f32
nn.ReLU                  pnnx_unique_161          1 1 228 229 #228=(1,512,25,25)f32 #229=(1,512,25,25)f32
nn.Conv2d                m.backbone.body.layer4.0.conv3 1 1 229 230 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(1,1) out_channels=2048 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(2048,512,1,1)f32 #229=(1,512,25,25)f32 #230=(1,2048,25,25)f32
pnnx.Attribute           pnnx_fold_scale.6        0 1 231 @data=(1,2048,1,1)f32 #231=(1,2048,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.6        0 1 232 @data=(1,2048,1,1)f32 #232=(1,2048,1,1)f32
nn.Conv2d                m.backbone.body.layer4.0.downsample.0 1 1 219 233 bias=False dilation=(1,1) groups=1 in_channels=1024 kernel_size=(1,1) out_channels=2048 padding=(0,0) padding_mode=zeros stride=(2,2) @weight=(2048,1024,1,1)f32 #219=(1,1024,50,50)f32 #233=(1,2048,25,25)f32
pnnx.Attribute           pnnx_fold_scale.7        0 1 234 @data=(1,2048,1,1)f32 #234=(1,2048,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.7        0 1 235 @data=(1,2048,1,1)f32 #235=(1,2048,1,1)f32
pnnx.Expression          pnnx_expr_1095           6 1 230 231 232 233 234 235 236 expr=add(add(mul(@0,@1),@2),add(mul(@3,@4),@5)) #230=(1,2048,25,25)f32 #231=(1,2048,1,1)f32 #232=(1,2048,1,1)f32 #233=(1,2048,25,25)f32 #234=(1,2048,1,1)f32 #235=(1,2048,1,1)f32 #236=(1,2048,25,25)f32
nn.ReLU                  pnnx_unique_168          1 1 236 237 #236=(1,2048,25,25)f32 #237=(1,2048,25,25)f32
nn.Conv2d                m.backbone.body.layer4.1.conv1 1 1 237 238 bias=False dilation=(1,1) groups=1 in_channels=2048 kernel_size=(1,1) out_channels=512 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(512,2048,1,1)f32 #237=(1,2048,25,25)f32 #238=(1,512,25,25)f32
pnnx.Attribute           pnnx_fold_scale.9        0 1 239 @data=(1,512,1,1)f32 #239=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.9        0 1 240 @data=(1,512,1,1)f32 #240=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1082           3 1 238 239 240 241 expr=add(mul(@0,@1),@2) #238=(1,512,25,25)f32 #239=(1,512,1,1)f32 #240=(1,512,1,1)f32 #241=(1,512,25,25)f32
nn.ReLU                  m.backbone.body.layer4.1.relu 1 1 241 242 #241=(1,512,25,25)f32 #242=(1,512,25,25)f32
nn.Conv2d                m.backbone.body.layer4.1.conv2 1 1 242 243 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(3,3) out_channels=512 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(512,512,3,3)f32 #242=(1,512,25,25)f32 #243=(1,512,25,25)f32
pnnx.Attribute           pnnx_fold_scale.11       0 1 244 @data=(1,512,1,1)f32 #244=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.11       0 1 245 @data=(1,512,1,1)f32 #245=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1070           3 1 243 244 245 246 expr=add(mul(@0,@1),@2) #243=(1,512,25,25)f32 #244=(1,512,1,1)f32 #245=(1,512,1,1)f32 #246=(1,512,25,25)f32
nn.ReLU                  pnnx_unique_175          1 1 246 247 #246=(1,512,25,25)f32 #247=(1,512,25,25)f32
nn.Conv2d                m.backbone.body.layer4.1.conv3 1 1 247 248 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(1,1) out_channels=2048 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(2048,512,1,1)f32 #247=(1,512,25,25)f32 #248=(1,2048,25,25)f32
pnnx.Attribute           pnnx_fold_scale.13       0 1 249 @data=(1,2048,1,1)f32 #249=(1,2048,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.13       0 1 250 @data=(1,2048,1,1)f32 #250=(1,2048,1,1)f32
pnnx.Expression          pnnx_expr_1057           4 1 248 249 250 237 251 expr=add(add(mul(@0,@1),@2),@3) #248=(1,2048,25,25)f32 #249=(1,2048,1,1)f32 #250=(1,2048,1,1)f32 #237=(1,2048,25,25)f32 #251=(1,2048,25,25)f32
nn.ReLU                  pnnx_unique_179          1 1 251 252 #251=(1,2048,25,25)f32 #252=(1,2048,25,25)f32
nn.Conv2d                m.backbone.body.layer4.2.conv1 1 1 252 253 bias=False dilation=(1,1) groups=1 in_channels=2048 kernel_size=(1,1) out_channels=512 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(512,2048,1,1)f32 #252=(1,2048,25,25)f32 #253=(1,512,25,25)f32
pnnx.Attribute           pnnx_fold_scale.2        0 1 254 @data=(1,512,1,1)f32 #254=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.2        0 1 255 @data=(1,512,1,1)f32 #255=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1044           3 1 253 254 255 256 expr=add(mul(@0,@1),@2) #253=(1,512,25,25)f32 #254=(1,512,1,1)f32 #255=(1,512,1,1)f32 #256=(1,512,25,25)f32
nn.ReLU                  m.backbone.body.layer4.2.relu 1 1 256 257 #256=(1,512,25,25)f32 #257=(1,512,25,25)f32
nn.Conv2d                m.backbone.body.layer4.2.conv2 1 1 257 258 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(3,3) out_channels=512 padding=(1,1) padding_mode=zeros stride=(1,1) @weight=(512,512,3,3)f32 #257=(1,512,25,25)f32 #258=(1,512,25,25)f32
pnnx.Attribute           pnnx_fold_scale.4        0 1 259 @data=(1,512,1,1)f32 #259=(1,512,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.4        0 1 260 @data=(1,512,1,1)f32 #260=(1,512,1,1)f32
pnnx.Expression          pnnx_expr_1032           3 1 258 259 260 261 expr=add(mul(@0,@1),@2) #258=(1,512,25,25)f32 #259=(1,512,1,1)f32 #260=(1,512,1,1)f32 #261=(1,512,25,25)f32
nn.ReLU                  pnnx_unique_186          1 1 261 262 #261=(1,512,25,25)f32 #262=(1,512,25,25)f32
nn.Conv2d                m.backbone.body.layer4.2.conv3 1 1 262 263 bias=False dilation=(1,1) groups=1 in_channels=512 kernel_size=(1,1) out_channels=2048 padding=(0,0) padding_mode=zeros stride=(1,1) @weight=(2048,512,1,1)f32 #262=(1,512,25,25)f32 #263=(1,2048,25,25)f32
pnnx.Attribute           pnnx_fold_scale.1        0 1 264 @data=(1,2048,1,1)f32 #264=(1,2048,1,1)f32
pnnx.Attribute           pnnx_fold_bias0.1        0 1 265 @data=(1,2048,1,1)f32 #265=(1,2048,1,1)f32
pnnx.Expression          pnnx_expr_1019           4 1 263 264 265 252 266 expr=add(add(mul(@0,@1),@2),@3) #263=(1,2048,25,25)f32 #264=(1,2048,1,1)f32 #265=(1,2048,1,1)f32 #252=(1,2048,25,25)f32 #266=(1,2048,25,25)f32
nn.ReLU                  pnnx_unique_190          1 1 266 267 #266=(1,2048,25,25)f32 #267=(1,2048,25,25)f32
nn.Conv2d                m.backbone.fpn.inner_blocks.3.0 1 1 267 268 bias=True dilation=(1,1) groups=1 in_channels=2048 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,2048,1,1)f32 #267=(1,2048,25,25)f32 #268=(1,256,25,25)f32
nn.Conv2d                m.backbone.fpn.layer_blocks.3.0 1 1 268 269 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,3,3)f32 #268=(1,256,25,25)f32 #269=(1,256,25,25)f32
nn.Conv2d                m.backbone.fpn.inner_blocks.2.0 1 1 219 270 bias=True dilation=(1,1) groups=1 in_channels=1024 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,1024,1,1)f32 #219=(1,1024,50,50)f32 #270=(1,256,50,50)f32
F.upsample_nearest       F.upsample_nearest_718   1 1 268 271 size=(50,50) $input=268 #268=(1,256,25,25)f32 #271=(1,256,50,50)f32
pnnx.Expression          pnnx_expr_1014           2 1 270 271 272 expr=add(@0,@1) #270=(1,256,50,50)f32 #271=(1,256,50,50)f32 #272=(1,256,50,50)f32
nn.Conv2d                m.backbone.fpn.layer_blocks.2.0 1 1 272 273 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,3,3)f32 #272=(1,256,50,50)f32 #273=(1,256,50,50)f32
nn.Conv2d                m.backbone.fpn.inner_blocks.1.0 1 1 126 274 bias=True dilation=(1,1) groups=1 in_channels=512 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,512,1,1)f32 #126=(1,512,100,100)f32 #274=(1,256,100,100)f32
F.upsample_nearest       F.upsample_nearest_719   1 1 272 275 size=(100,100) $input=272 #272=(1,256,50,50)f32 #275=(1,256,100,100)f32
pnnx.Expression          pnnx_expr_1009           2 1 274 275 276 expr=add(@0,@1) #274=(1,256,100,100)f32 #275=(1,256,100,100)f32 #276=(1,256,100,100)f32
nn.Conv2d                m.backbone.fpn.layer_blocks.1.0 1 1 276 277 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,3,3)f32 #276=(1,256,100,100)f32 #277=(1,256,100,100)f32
nn.Conv2d                m.backbone.fpn.inner_blocks.0.0 1 1 63 278 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=256 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,1,1)f32 #63=(1,256,200,200)f32 #278=(1,256,200,200)f32
F.upsample_nearest       F.upsample_nearest_720   1 1 276 279 size=(200,200) $input=276 #276=(1,256,100,100)f32 #279=(1,256,200,200)f32
pnnx.Expression          pnnx_expr_1004           2 1 278 279 280 expr=add(@0,@1) #278=(1,256,200,200)f32 #279=(1,256,200,200)f32 #280=(1,256,200,200)f32
nn.Conv2d                m.backbone.fpn.layer_blocks.0.0 1 1 280 281 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,3,3)f32 #280=(1,256,200,200)f32 #281=(1,256,200,200)f32
F.max_pool2d             F.max_pool2d_723         1 1 269 282 ceil_mode=False dilation=(1,1) kernel_size=(1,1) padding=(0,0) return_indices=False stride=(2,2) $input=269 #269=(1,256,25,25)f32 #282=(1,256,13,13)f32
nn.Conv2d                m.rpn.head.conv.0.0      1 1 281 283 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,3,3)f32 #281=(1,256,200,200)f32 #283=(1,256,200,200)f32
nn.ReLU                  m.rpn.head.conv.0.1      1 1 283 284 #283=(1,256,200,200)f32 #284=(1,256,200,200)f32
nn.Conv2d                m.rpn.head.cls_logits    1 1 284 285 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=3 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(3)f32 @weight=(3,256,1,1)f32 #284=(1,256,200,200)f32 #285=(1,3,200,200)f32
nn.Conv2d                m.rpn.head.bbox_pred     1 1 284 286 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=12 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(12)f32 @weight=(12,256,1,1)f32 #284=(1,256,200,200)f32 #286=(1,12,200,200)f32
nn.Conv2d                pnnx_unique_191          1 1 277 287 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,3,3)f32 #277=(1,256,100,100)f32 #287=(1,256,100,100)f32
nn.ReLU                  pnnx_unique_192          1 1 287 288 #287=(1,256,100,100)f32 #288=(1,256,100,100)f32
nn.Conv2d                pnnx_unique_193          1 1 288 289 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=3 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(3)f32 @weight=(3,256,1,1)f32 #288=(1,256,100,100)f32 #289=(1,3,100,100)f32
nn.Conv2d                pnnx_unique_194          1 1 288 290 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=12 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(12)f32 @weight=(12,256,1,1)f32 #288=(1,256,100,100)f32 #290=(1,12,100,100)f32
nn.Conv2d                pnnx_unique_195          1 1 273 291 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,3,3)f32 #273=(1,256,50,50)f32 #291=(1,256,50,50)f32
nn.ReLU                  pnnx_unique_196          1 1 291 292 #291=(1,256,50,50)f32 #292=(1,256,50,50)f32
nn.Conv2d                pnnx_unique_197          1 1 292 293 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=3 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(3)f32 @weight=(3,256,1,1)f32 #292=(1,256,50,50)f32 #293=(1,3,50,50)f32
nn.Conv2d                pnnx_unique_198          1 1 292 294 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=12 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(12)f32 @weight=(12,256,1,1)f32 #292=(1,256,50,50)f32 #294=(1,12,50,50)f32
nn.Conv2d                pnnx_unique_199          1 1 269 295 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,3,3)f32 #269=(1,256,25,25)f32 #295=(1,256,25,25)f32
nn.ReLU                  pnnx_unique_200          1 1 295 296 #295=(1,256,25,25)f32 #296=(1,256,25,25)f32
nn.Conv2d                pnnx_unique_201          1 1 296 297 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=3 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(3)f32 @weight=(3,256,1,1)f32 #296=(1,256,25,25)f32 #297=(1,3,25,25)f32
nn.Conv2d                pnnx_unique_202          1 1 296 298 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=12 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(12)f32 @weight=(12,256,1,1)f32 #296=(1,256,25,25)f32 #298=(1,12,25,25)f32
nn.Conv2d                pnnx_unique_203          1 1 282 299 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(3,3) out_channels=256 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(256)f32 @weight=(256,256,3,3)f32 #282=(1,256,13,13)f32 #299=(1,256,13,13)f32
nn.ReLU                  pnnx_unique_204          1 1 299 300 #299=(1,256,13,13)f32 #300=(1,256,13,13)f32
nn.Conv2d                pnnx_unique_205          1 1 300 301 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=3 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(3)f32 @weight=(3,256,1,1)f32 #300=(1,256,13,13)f32 #301=(1,3,13,13)f32
nn.Conv2d                pnnx_unique_206          1 1 300 302 bias=True dilation=(1,1) groups=1 in_channels=256 kernel_size=(1,1) out_channels=12 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(12)f32 @weight=(12,256,1,1)f32 #300=(1,256,13,13)f32 #302=(1,12,13,13)f32
Tensor.reshape           Tensor.reshape_515       1 1 285 303 shape=(1,3,1,200,200) $input=285 #285=(1,3,200,200)f32 #303=(1,3,1,200,200)f32
Tensor.permute           Tensor.permute_246       1 1 303 304 dims=(0,3,4,1,2) $input=303 #303=(1,3,1,200,200)f32 #304=(1,200,200,3,1)f32
Tensor.reshape           Tensor.reshape_483       1 1 304 305 shape=(1,120000,1) $input=304 #304=(1,200,200,3,1)f32 #305=(1,120000,1)f32
Tensor.reshape           Tensor.reshape_516       1 1 286 306 shape=(1,3,4,200,200) $input=286 #286=(1,12,200,200)f32 #306=(1,3,4,200,200)f32
Tensor.permute           Tensor.permute_247       1 1 306 307 dims=(0,3,4,1,2) $input=306 #306=(1,3,4,200,200)f32 #307=(1,200,200,3,4)f32
Tensor.reshape           Tensor.reshape_484       1 1 307 308 shape=(1,120000,4) $input=307 #307=(1,200,200,3,4)f32 #308=(1,120000,4)f32
Tensor.reshape           Tensor.reshape_517       1 1 289 309 shape=(1,3,1,100,100) $input=289 #289=(1,3,100,100)f32 #309=(1,3,1,100,100)f32
Tensor.permute           Tensor.permute_248       1 1 309 310 dims=(0,3,4,1,2) $input=309 #309=(1,3,1,100,100)f32 #310=(1,100,100,3,1)f32
Tensor.reshape           Tensor.reshape_485       1 1 310 311 shape=(1,30000,1) $input=310 #310=(1,100,100,3,1)f32 #311=(1,30000,1)f32
